/*****************************************************************************
 *
 * �ļ�����: NTC�¶�
 * �������: void
 * �޸ļ�¼:
 *
 *           1. 2016-8-19 chenyue Create
 *****************************************************************************/

/*****************************************************************************
**                          ͷ�ļ������ͺ궨��
******************************************************************************/
#include "main.h"
#include "ntc.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
//const uint16_t Temp_Tab[] = {
//1128 ,1149 ,1170 ,1191 ,1211 ,1222 ,1232 ,1310 ,1347 ,1365 ,1374 ,1392 ,1419 ,1470 , 
//1504 ,1520 ,1536 ,1560 ,1583 ,1614 ,1672 ,1687 ,1701 ,1715 ,1728 ,1795 ,1808 ,1820 ,
//1858 ,1917 ,1940 ,1974 ,2027 ,2048 ,2098 ,2146 ,2173 ,2191 ,2208 ,2226 ,2234 ,2251 ,
//2276 ,2292 ,2315 ,2353 ,2389 ,2424 ,2458 ,2521 ,2579 ,2607 ,2633 ,2684 ,2731 ,2775 ,
//2796 ,2816 ,2855 ,2891 ,2926 ,2958 ,2989 ,3018 ,3046 ,3072 ,3085 ,3097 ,3121 ,3186 ,
//3225 ,3243 ,3260 ,3277 ,3285 ,3293 ,3316 ,3390 ,3402 ,3425 ,3435 ,3446 ,3502 ,3511 ,
//3527 ,3550 ,3571 ,3584 ,3603 ,3625 ,3641 ,3651 ,3665 ,3686 ,3710 ,3724 ,3740 ,3749 ,
//3755 ,3768 ,3781 ,3793 ,3799 ,3814 ,3840 ,3855 ,3868 ,3880 ,3891 ,3901 ,3905 ,3910 ,
//3916 ,3922 ,3925 ,3950 ,3955 ,3959 ,3964 ,3968 ,3972 ,3976 ,3982 ,3996 ,3998 ,4002 ,
//4005 ,4024 ,4016 ,4020 ,4024 ,4028 ,4030 ,4033 ,4039 ,4041 ,4045 ,4048 ,4051 ,4055 ,
//4057 ,4059 ,4060 ,4061 ,4062 ,4063 ,4065 ,4067 ,4069 ,4071 ,4075 ,4076 ,4077 ,4077 ,
//4080 ,4081 ,4082 ,4082, 4083 ,4084 ,4085  
//};
uint16_t const Temp_Tab[166]={
19565,//[-40]
18491,17484,16539,15651,14817,14033,13295,12602,11949,11334,//[-39 -30]
10756,10211,9697,9213,8755,8324,7916,7531,7167,6823,//[-29 -20]
6499,6191,5901,5625,5364,5117,4883,4661,4450,4250,//[-19 -10]
4059,3879,3707,3544,3389,3241,3102,2968,2842,2721,//[-9 0]
2607,2498,2395,2296,2202,2112,2026,1944,1866,1792,//[1 10]
1721,1653,1588,1526,1467,1410,1356,1304,1255,1208,//[11 20]
1162,1119,1077,1038,1000,963,928,894,862,831,//[21 30]
801,773,746,719,694,670,647,625,603,583,//[31 40]
563,544,526,508,491,475,459,444,430,416,//[41 50]
402,389,377,365,353,342,331,321,311,301,//[51 60]
292,283,274,266,258,250,243,236,229,222,//[61 70]
216,210,203,198,192,186,181,176,171,166,//[71 80]
162,157,153,149,145,141,137,133,130,126,//[81 90]
123,120,117,113,110,108,105,102,99,97,//[91 100]
94,92,90,87,85,83,81,79,77,75,//[101 110]
73,72,70,68,67,65,64,62,61,59,//[111 120]
58,56,55,54,53,//[121 125]
};

/** 
 * Get Temperature of list.
 * 
 * @param Temp_Tab   温度对应的ADC值列表
 * @param listlen   列表长度
 * @param adcdata   采集到的ADC值  
 * @param tempmin   温度下限 必须为负值
 * @return  温度 0xffff表示超出范围
 */
 int16_t Temp_Buf;uint16_t Tab_Add,Tab_Addfouse;
//uint32_t tab0=0,tabend=0;
int16_t Temp_Coun(uint16_t Temp_Data)
{
  int16_t Temp_Buf;
	

  Tab_Add = 0;Tab_Addfouse=0;

//	  if(Temp_Data>Temp_Tab[0]||Temp_Data<Temp_Tab[1000])  //溢出范围的处理
//		{
//			Temp_Buf = 0x64;
//		}
//  else


	if(Temp_Data>=Temp_Tab[0])
	{
		Temp_Buf = -400;
	}
	if(Temp_Data<=Temp_Tab[165])
	{
		Temp_Buf = 1250;
	}
	if(Temp_Tab[165]<Temp_Data<Temp_Tab[0])
		{
			do
			{
				
			Tab_Add++;
			
			}
			while(Temp_Data<=Temp_Tab[Tab_Add]);
			Tab_Add--;
			do
			{
				
			Tab_Addfouse++;
			
			}
			while(Temp_Data<=(Temp_Tab[Tab_Add]-((Temp_Tab[Tab_Add]-Temp_Tab[Tab_Add+1])*Tab_Addfouse/10)));
			
			
			Temp_Buf =-400+Tab_Add*10+Tab_Addfouse;
		}

  return Temp_Buf;
}
//int16_t Temp_Coun(uint32_t Temp_Data)
//{

//	uint16_t Tab_Add=0,Tab_Add2=0;
//  Tab_Add = 0;
//	uint16_t y=0;
//uint32_t detem=0;
//	Tab_Add=0;Tab_Add2=0;
//	if(Temp_Data>=Temp_Tab[0]*10)
//	{
//		Temp_Buf = -300;
//	}
//	if(Temp_Data<=Temp_Tab[150]*10)
//	{
//		Temp_Buf = 120;
//	}
//	if(Temp_Tab[0]*10>Temp_Data&&Temp_Data>Temp_Tab[150]*10)
//		{
//		detem=(Temp_Tab[Tab_Add]*10-(Temp_Tab[Tab_Add]-Temp_Tab[Tab_Add+1])*Tab_Add2);
//			while(Temp_Data<=detem)
//			{
//				Tab_Add2++;
////				printf("%d %d ",Tab_Add,Tab_Add2);

//				detem=(Temp_Tab[Tab_Add]*10-(Temp_Tab[Tab_Add]-Temp_Tab[Tab_Add+1])*Tab_Add2);
////				printf(" %d %d\n",(Temp_Tab[Tab_Add]-Temp_Tab[Tab_Add+1])*Tab_Add2/10,detem);
//				if(Tab_Add2%10==0)
//				{
//						Tab_Add++;Tab_Add2=0;
//				}
//				
//			}
//			
//			Temp_Buf =-301+Tab_Add*10+Tab_Add2;
//		}

//  return Temp_Buf;
//}
uint32_t NTC_R;int16_t SUM_TEM=0;uint16_t adcsum=0;
int8_t GetTemperature(uint16_t adcdata) {
	adcsum=adcdata;
	NTC_R=(1000*adcdata)/(4000-adcdata);//10欧姆为一个单位
	//NTC_R=(1000*(4096-adcdata))/adcdata;
	SUM_TEM=(Temp_Coun(NTC_R/10));
	return (SUM_TEM>>8);
		//(int8_t)_GetTemperature(Temp_Tab,sizeof(Temp_Tab)/sizeof(Temp_Tab[0]),adcdata,(-50));
}


/** 
 * 卡尔曼滤波器.
 * 
 * @param  inData   测量值
 * @return  最优值
 */
float kalmanFilter_A(float inData) 
{
  static float prevData=0; 
  static float p=10, q=0.0001, r=0.050, kGain=0;
	//过程噪声的方差Q和测量噪声的方差R、卡尔曼增益kGain
	//prevData上一次的值
    p += q; 
    kGain = p/(p+r);

    inData = prevData+(kGain*(inData-prevData)); 
	
    p = (1-kGain)*p;
    prevData = inData;
    return inData; 
}
/*****************************************************************************
**                            End of File
******************************************************************************/
